[
  {
    "id": "home",
    "text": "RAMI\nKRONBI\nAI & Computer Vision Engineer\nBuilding multidisciplinary intelligent systems—from autonomous robotics to enterprise computer vision and real-time ML applications.\nMISSION\nComputer Vision\nReal-Time AI\nAutonomous Robotics\nEdge ML\nMachine Learning"
  },
  {
    "id": "community",
    "text": "MISSION &\nVISION\nBuilding Communities Beyond Code\n\"Nasna\" - crisis support\nFounder of a nonprofit NGO that applies data to deliver aid and crisis support to communities impacted by the war in Lebanon.\n2024\nNASA Space Apps Beirut\nOrganizing the Beirut chapter of NASA's Space Apps—the world's largest global hackathon\n2022 - 2025\nDaleel (دليل)\nSecurity-first platform for Lebanese election transparency. Features immutable history, source archiving, and multilingual support.\n2026\nDevFest Beirut\nDelivered a lecture on embedded AI at Lebanon's premier developer conference.\n2025\nNational Physics Day\nLeading and organizing Lebanon's biggest annual event for the physics and astronomy community.\n2021 - 2025\nEXPLORE"
  },
  {
    "id": "experience",
    "text": "Professional\nExperience\nMilestones & Achievements\nNow\nEVOID\nFounder & Tech Lead\nBuilding bespoke AI/CV and robotics products for startups + industry teams.\nImpact\n4+\nYears Experience\n10+\nProjects Delivered\n5+\nAwards Won\n2024 - Now\nOreyeon LDA\nApplied AI & CV Engineer\nImproving runway safety through advanced computer vision solutions.\n2023\nChampion\nWRO Future Engineers\nLed an autonomous race-car build from concept to podium in 20 days.\n2021 - 2024\nTech Lead & Volunteer\nNASA Space Apps\nTook part in leading the largest global hackathon in Lebanon.\nContinuously growing\nAlways learning"
  },
  {
    "id": "projects",
    "text": "Real work,\ndelivered with impact\nPortfolio Projects\nReal-Time Thermal Super-Resolution System\nMachine learning system that enhances low-resolution thermal camera feeds to high-quality images at 229+ FPS for robotics and autonomous systems.\nReal-Time Lebanese Sign Language Translator\nAI system that translates Lebanese Sign Language into spoken and written text in real-time using computer vision and natural language processing.\nAutonomous Race Car - WRO 2023 Champion\nFully autonomous vehicle built in 20 days that won the World Robot Olympiad Future Engineers 2023 competition using computer vision and sensor fusion.\nAI-Powered Smart Desk for Classrooms\nIoT desk with computer vision-based posture tracking and automatic ergonomic adjustments for enhanced learning and health outcomes.\n360° Spherical Mobile Panorama\nA professional computer vision pipeline for creating seamless 360° spherical panoramas from phone footage.\nEXPLORE\nWant a similar transformation?\nLet's design your roadmap\nand launch faster."
  },
  {
    "id": "testimonials",
    "text": "Global\nEndorsements\nPeople I have worked with\n\"\nWorking together has been a genuinely great experience. Rami consistently showed professionalism, clear communication, and a strong sense of ownership over your work. What stood out most was his ability to translate ideas into practical results while staying open to feedback.\nKhaled Frayji\nFounder & CEO\n@\nTechTalks\nBeirut, Lebanon\nRamy is exceptionally smart, quick to grasp concepts, and highly adaptable. I have worked with him on several projects. Rami delivered high-quality work with impressive efficiency and professionalism. Rami stands out for his technical strength, problem-solving skills, and reliability. He is an outstanding engineer and a great person to work with\nDr. Ahmad Audi\nSenior CV Engineer, Professor\nLAU\nIt was a pleasure working with Ramy, who demonstrated outstanding professionalism, solid technical expertise, and excellent public speaking and interpersonal skills throughout our collaboration.\nSara Rashidi\nCodeWithSerah\nInternational\nEXPLORE"
  },
  {
    "id": "blog",
    "text": "Latest Articles\nBLOG ARTICLES\nExploring AI, Computer Vision, and Technology through writing\n18h ago\nSeeing in the Dark: Real-Time Thermal Super-Resolution\nReal-time thermal super-resolution system that enhances low-resolution thermal camera feeds to high-quality images at 229+ FPS for robotics and autonomous systems.\n24d ago\nAI Should Serve Society - Not Just Industry and Billionaires\nBuild with purpose. Others will follow. When AI serves only industry titans and billionaires, we miss out on its most profound potential: the ability to uplift society at large."
  },
  {
    "id": "certifications",
    "text": "Certifications & recognition\nProof of execution\nGoogle Project Management: Professional Certificate\nGoogle / Coursera\nIssued:\nOngoing\nID:\nJDQM5WZLUW27\nVerify certificate\nFull Stack Software Development: Forward Mena\nForward Mena/ OnRamp Lebanon\nSupervised Machine Learning: Regression and Classification\nStanford University\nFinished"
  },
  {
    "id": "services",
    "text": "Services with\nclear outcomes\nSignature engagements\n4-8 weeks\nAI Solutions\nScope, prototype, and validate AI ideas without a full in-house team.\nRoadmap + KPIs\nHands-on build\nWeekly reviews\n3-6 weeks\nComputer Vision Systems\nPerception stacks tuned for robotics, inspection, and edge deployments.\nDataset plan\nModel + optimization\nDeployment ready\n2-4 weeks\nML Advisory\nAudits, hiring support, and tighter ML processes for growing teams.\nArchitecture audit\nTeam enablement\nHiring support\n4-10 weeks\nRobotics & Autonomy\nSensor fusion, control, and system design with PM rigor.\nFirmware + CV\nSim + field tests\nDocumentation\nEXPLORE"
  },
  {
    "id": "contact",
    "text": "Let's build your next intelligent product\nPreferred channels\nGitHub\nCase studies\nLinkedIn\nProfessional updates\nramykronby@gmail.com\nBest for briefs\nOpen to new opportunities and collaborations.\nTypical response time: 24-48 hours."
  },
  {
    "id": "faq",
    "text": "Frequently Asked\nQuestions\nEverything you need to know\nWhat does Rami Kronbi specialize in?\nRami Kronbi specializes in AI and Computer Vision engineering. He builds multidisciplinary intelligent systems including real-time computer vision applications, autonomous robotics, edge-optimized ML deployment, and custom machine learning solutions. His expertise spans the full development lifecycle from prototype to production deployment, with a focus on delivering production-ready systems for startups, agencies, and tech companies.\nWhat kind of projects does Rami Kronbi work on?\nRami works on production-ready AI systems across multiple domains: computer vision for robotics and enterprise applications, real-time perception systems for autonomous vehicles, thermal imaging pipelines, sign language translation systems, and custom machine learning solutions. His projects include autonomous race cars, thermal super-resolution systems achieving 229+ FPS, AI-powered accessibility tools, and IoT smart systems. Project engagements typically range from 3-10 weeks depending on complexity and scope.\nWho does Rami Kronbi work with?\nRami works with startups building intelligent products, agencies delivering AI solutions to their clients, and tech companies modernizing their systems with computer vision and machine learning. His clients operate across multiple industries including robotics, autonomous systems, industrial inspection, accessibility technology, and enterprise AI applications. He serves teams that need reliable, production-ready computer vision and ML solutions delivered efficiently.\nWhat technologies does Rami Kronbi use?\nRami works with PyTorch and TensorFlow for deep learning model development, OpenCV for computer vision applications, and TensorRT for edge optimization and production deployment. He has extensive experience with embedded systems platforms including Jetson Nano, ESP32, and Arduino. His technical stack also includes Python and C++ for system development, and he specializes in optimizing models for real-time performance on edge devices and embedded systems.\nHow can I hire Rami Kronbi for a project?\nFor project inquiries, email ramykronby@gmail.com with your project brief including scope, timeline, and technical requirements. Typical response time is 24-48 hours. Rami offers several engagement types: AI Solutions (4-8 weeks), Computer Vision Systems (3-6 weeks), ML Advisory (2-4 weeks), and Robotics & Autonomy projects (4-10 weeks). He is open to new opportunities and collaborations with startups, agencies, and tech companies.\nWhat makes Rami Kronbi different from other AI engineers?\nRami brings hands-on experience across the full AI development cycle—from research and prototyping to production deployment and edge optimization. He has built award-winning autonomous systems (WRO 2023 Champion), delivered real-time AI solutions achieving industry-leading performance (thermal SR at 229+ FPS), and led community initiatives including NASA Space Apps Beirut and crisis support NGOs. His multidisciplinary approach combines computer vision, robotics, and systems engineering to deliver reliable, production-ready solutions rather than just research prototypes.\nHave more questions?\nGet in touch"
  }
]